validationAndVerificationSuite/validation/overset/NACA4412-airfoil/noOverset/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
         solver            CG;
         preconditioner    Cholesky;

         minIter           1;
         maxIter           200;
         tolerance         1e-7;
         relTol            0.001;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        tolerance        1e-08;
        relTol           0.01;
        minIter          1;
        maxIter          10;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;

        tolerance        1e-08;
        relTol           0.1;
        minIter          1;
        maxIter          10;
    }

    omega
    {
        solver           smoothSolver;
        smoother         GaussSeidel;

        tolerance        1e-08;
        relTol           0.1;
        minIter          1;
        maxIter          10;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        U               0.7;
        k               0.5;
        epsilon         0.5;
    }
    fields
    {
        p               0.3;
    }
}

// ************************************************************************* //
